tutorials/turbulentFlameletRhoSimplecFoam/combustionChamber/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{
    inletfuel           
    {
	type 		flowRateInletVelocity;
	flowRate	constant 0.00015;
        value           uniform (0 0 0);
    }
    inletair           
    {
	type 		flowRateInletVelocity;
	flowRate	constant 0.0001;
        value           uniform (0 0 0);
    }

    outlet          
    {
	type 		zeroGradient;
	value		uniform (0 0 0.1);
    }

    "wall.*"
    {
	type 		fixedValue;
	value		uniform (0 0 0);
    }

}


// ************************************************************************* //
