tutorials/turbulentFlameletRhoSimplecFoam/combustionChamber/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inletfuel
    {
	type            turbulentIntensityKineticEnergyInlet;
	intensity	0.1;
	value           uniform 0.1;

    }

    inletair
    {   
	type            turbulentIntensityKineticEnergyInlet;
	intensity	0.05;
	value		uniform 0.1;
       
    }

    outlet
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            compressible::kqRWallFunction;
	value		uniform 0.1;
    }
}


// ************************************************************************* //
